'''
 Author: Lucas Glasner (lgvivanco96@gmail.com)
 Create Time: 2024-11-03 21:34:05
 Modified by: Lucas Glasner, 
 Modified time: 2024-11-06 09:56:20
 Description:
 Dependencies:
'''

import os
import pandas as pd
import geopandas as gpd

# ----------------------------------- PATHS ---------------------------------- #
ROOT_FOLDER = os.path.dirname(os.path.abspath(__file__))
DATA_FOLDER = os.path.join(ROOT_FOLDER, 'resources')
SHYETO_PATH = os.path.join(DATA_FOLDER, 'synthetic_storms.csv')
AB_ZONEPATH = os.path.join(DATA_FOLDER, 'vector', 'ZONAS_LINSLEYCHILE.shp')
CHILE_GRAYZONEPATH = os.path.join(DATA_FOLDER, 'vector', 'ZONAS_GRAYCHILE.shp')

# ---------------------------- DATA AND PARAMETERS --------------------------- #
SHYETO_DATA = pd.read_csv(SHYETO_PATH, index_col=0)

CHILE_UH_LINSLEYPOLYGONS = gpd.read_file(AB_ZONEPATH)
CHILE_UH_LINSLEYPARAMS = {
    'C_t': [0.323,   0.584,   1.351,   0.386],
    'n_t': [0.422,	0.327,   0.237,   0.397],
    'C_p': [144.141, 522.514, 172.775, 355.2],
    'n_p': [-0.796, -1.511,  -0.835,  -1.22],
    'C_b': [5.377,	1.822,	 5.428,	  2.7],
    'n_b': [0.805,	1.412,	 0.717,	  1.104]
}
CHILE_UH_LINSLEYPARAMS = pd.DataFrame(CHILE_UH_LINSLEYPARAMS).T
CHILE_UH_LINSLEYPARAMS.columns = ['I', 'II', 'III', 'IV']

CHILE_UH_GRAYPOLYGONS = gpd.read_file(CHILE_GRAYZONEPATH)
CHILE_UH_GRAYPARAMS = {'a': 24.48, 'b': 0.155}
GDAL_EXCEPTIONS = True
GRAVITY = 9.81

# ---------------------------- DURATION COEFFICIENTS -------------------------- #
DURCOEFS_PGAUGES = {
    'Putre':         [0.44, 0.62, 0.73, 0.78, 0.81, 0.82, 0.83, 0.83, 0.87, 1.],
    'Lequena':       [0.34, 0.52, 0.75, 0.87, 0.93, 0.94, 0.95, 0.96, 0.97, 1.],
    'Toconce':       [0.39, 0.57, 0.79, 0.90, 0.94, 0.94, 0.95, 0.95, 0.97, 1.],
    'Rivadavia':     [0.12, 0.21, 0.35, 0.48, 0.59, 0.68, 0.75, 0.78, 0.87, 1.],
    'La Paloma':     [0.15, 0.25, 0.41, 0.55, 0.65, 0.74, 0.80, 0.84, 0.92, 1.],
    'Illapel':       [0.14, 0.25, 0.41, 0.54, 0.66, 0.73, 0.79, 0.84, 0.92, 1.],
    'La Tranquilla': [0.11, 0.19, 0.31, 0.40, 0.49, 0.57, 0.64, 0.72, 0.87, 1.],
    'Quillota':      [0.13, 0.23, 0.38, 0.50, 0.58, 0.67, 0.75, 0.80, 0.88, 1.],
    'Rungue':        [0.09, 0.18, 0.31, 0.44, 0.53, 0.62, 0.69, 0.73, 0.84, 1.],
    'Lago Peñuelas': [0.12, 0.21, 0.37, 0.49, 0.60, 0.68, 0.76, 0.82, 0.92, 1.],
    'Los Panguiles': [0.16, 0.27, 0.41, 0.55, 0.66, 0.78, 0.83, 0.86, 0.90, 1.],
    'Quinta Normal': [0.14, 0.23, 0.38, 0.51, 0.63, 0.70, 0.77, 0.82, 0.90, 1.],
    'San Joaquin':   [0.15, 0.24, 0.38, 0.51, 0.60, 0.69, 0.70, 0.80, 0.91, 1.],
    'Pirque':        [0.11, 0.17, 0.30, 0.40, 0.49, 0.57, 0.63, 0.69, 0.82, 1.],
    'Melipilla':     [0.12, 0.21, 0.35, 0.47, 0.55, 0.63, 0.68, 0.75, 0.88, 1.],
    'Rapel':         [0.15, 0.23, 0.33, 0.47, 0.56, 0.64, 0.72, 0.78, 0.92, 1.],
    'Llaullauquén':  [0.16, 0.25, 0.40, 0.50, 0.57, 0.64, 0.70, 0.76, 0.86, 1.],
    'San Fernando':  [0.12, 0.20, 0.33, 0.43, 0.52, 0.61, 0.68, 0.73, 0.85, 1.],
    'Curicó':        [0.15, 0.22, 0.35, 0.45, 0.54, 0.63, 0.71, 0.79, 0.89, 1.],
    'Armerillo':     [0.08, 0.15, 0.26, 0.37, 0.47, 0.56, 0.64, 0.71, 0.83, 1.],
    'Colbún':        [0.12, 0.19, 0.29, 0.41, 0.52, 0.59, 0.68, 0.73, 0.83, 1.],
    'Chillán':       [0.13, 0.21, 0.34, 0.42, 0.49, 0.55, 0.61, 0.69, 0.84, 1.],
    'Concepción':    [0.19, 0.30, 0.39, 0.48, 0.56, 0.64, 0.70, 0.76, 0.90, 1.],
    'Polcura':       [0.11, 0.18, 0.31, 0.42, 0.51, 0.59, 0.66, 0.73, 0.84, 1.],
    'Quilaco':       [0.17, 0.26, 0.37, 0.45, 0.54, 0.61, 0.67, 0.74, 0.88, 1.],
    'Temuco':        [0.21, 0.32, 0.50, 0.59, 0.67, 0.73, 0.79, 0.84, 0.91, 1.],
    'Pullinque':     [0.12, 0.20, 0.33, 0.43, 0.50, 0.58, 0.65, 0.72, 0.84, 1.],
    'Valdivia':      [0.13, 0.18, 0.31, 0.43, 0.53, 0.60, 0.67, 0.74, 0.89, 1.],
    'Osorno':        [0.20, 0.33, 0.50, 0.60, 0.65, 0.69, 0.75, 0.82, 0.92, 1.],
    'Ensenada':      [0.17, 0.23, 0.35, 0.46, 0.53, 0.60, 0.68, 0.74, 0.86, 1.],
    'Puerto Montt':  [0.16, 0.27, 0.36, 0.47, 0.55, 0.62, 0.70, 0.77, 0.88, 1.],
    'Lago Chapo':    [0.09, 0.16, 0.28, 0.37, 0.46, 0.55, 0.64, 0.71, 0.85, 1.],
    'Canutillar':    [0.11, 0.20, 0.33, 0.44, 0.54, 0.63, 0.68, 0.75, 0.82, 1.],
    'Chaitén':       [0.18, 0.29, 0.42, 0.51, 0.61, 0.69, 0.75, 0.81, 0.91, 1.],
    'Puerto Aysén':  [0.14, 0.23, 0.38, 0.51, 0.60, 0.71, 0.81, 0.88, 0.98, 1.],
    'Punta Arenas':  [0.20, 0.33, 0.48, 0.61, 0.73, 0.81, 0.86, 0.91, 0.97, 1.]
}
DURCOEFS_PGAUGES = pd.DataFrame(DURCOEFS_PGAUGES,
                                index=[1, 2, 4, 6, 8, 10, 12, 14, 18, 24])
